{"code":"010110","description":"水风井","guacishi":"水风井\r\n村邑变时井不迁\r\n时光流逝井依然\r\n汲瓶取水瓶先破\r\n劳却无功恶运","jiegua":"卦辞：枯井破了已多年，一朝涌泉出水新。资生济渴人称羡，时来运转乐自然。 \r\n推断：精神渐爽，富禄日增，出入皆吉，百事亨通。 \r\n大象：水被植物吸收，滋养树身又象徵汲器入井取水，有节约重覆之意。 \r\n运势：井为静物，不能移动，故凡事不能进取主动，又缺乏冲劲，不如处之泰然更有利。 \r\n爱情：形势不大理想，有分开再合之象，故往后可成。 \r\n疾病：病情较重且拖延，可能是发。 \r\n失物：不能寻回。 \r\n诉讼：有刑罚之象，且受人牵连，及防房地产之诉讼。","jiewen":"《井卦》：象征无穷：改变迁移城邑不会使水井发生改变和迁徙，井水不会枯竭也不会溢满，来来往往的人都到井里来打水。提水提到井口眼看就要上来了，却把水瓶打翻了，这是凶险的兆头。《象》曰：木上有水，井；君子以劳民劝相。《象辞》说：《井卦》的卦象是巽（木）下坎（水）上，即是说水分沿着树身向上运行，直达树冠，为井水源源不断地被汲引到地面之表象，因此象征无穷；井水无穷无尽，孜孜不倦地养育着人们，君子应当效法这种美德，不辞劳苦地为大众谋福利，倡导助人为乐的社会风尚。\r\n\r\n初六，井底淤满了污泥不能供人饮用，历尽沧桑，年久失修的老井连鸟雀都不来光顾。《象》曰：“井泥不食”，下也；“旧井无禽”，时舍也。《象辞》说：“井底淤满了污泥不能供人饮用”，完全是因为位置处在最下面，相当于井底部位，水中泥沙不断沉淀最后都淤积在这里；“历尽沧桑、年久失修的老井连鸟雀都不来光顾”，反映出一种时过境迁，被世间万物所遗忘抛弃的凄凉遭遇。\r\n\r\n九二，井底容水的凹穴被当作捉鱼的场所，汲水的瓮也破损漏水不能再用。《象》曰：“井谷射鲋”，无与也。《象辞》说：“井底容水的凹穴被当作捉鱼的场所”，主要是由于上面没有接应，难以把水送到地面上去供人饮用。于是井的作用得不到发挥，只好退而求其次，盛水的地方成了抓鱼的所在。由于水井陷于瘫痪状态，因而汲水的器具也破损不堪用不成了。\r\n\r\n九三，井水淘干净了却不饮用，使我心中不免失望；可以赶快汲来尽情享用，君王贤明是大家共同的福气。《象》曰：“井渫不食”，行恻也；求“王明”，受福也。《象辞》说：“井水淘干净了却不饮用”，表明尽管血气方刚，一心想有所作为而使世人受益，却苦于一片好心无人领受，满怀热情的善行只落了个令人悲叹的结局；希望“君王贤明”，直接从井水说到人事，盼望圣明的君主出现，思贤若渴，像汲水一样选拔吸收重用人才，就能给国家带来吉祥，君臣万民都可以享受到由此带来的恩惠。\r\n\r\n六四，用砖石垒砌加固井壁，不会遇到灾祸。《象》曰：“井甃无咎”，修井也。《象辞》说：“用砖石垒砌加固井壁，不会遇到灾祸”，表明六四爻以阴柔之象处在《井卦》居中部位，正好相当于井壁的关键部位，不可有丝毫闪失。因此应当及时修缮使其坚固，才能免除灾祸。\r\n\r\n九五，井水清澈明净，就像甘甜凉爽的泉水一样可供天下人饮用。《象》曰：“寒泉之食”，中正也。《象辞》说：“像甘甜凉爽的泉水一样可供天下人饮用”，这是因为九五爻处在最尊贵的地位，位置适中而且十分妥当。象征行为不偏不倚，内心纯正无私。因而能够集中体现水井滋润万物，造福大众的美德。\r\n\r\n上六，水井养人润物的功德业已完成，不要盖上井口；内心怀着一片诚意，定能带来大吉大利。《象》曰：“元吉”在上，大成也。《象辞》说：“大吉大利”的情况出现在《井卦》最上面的位置，是因为上下照应，同心协力可将水提出井口。而且在这以后并不把井口盖严，继续怀着诚心为人们不断提供饮水的方便，功德无量，必然会有大吉大利到来。从而标志着滋养世人的宏伟事业获得了巨大的成功。","level":"上上卦","name":"井","secondName":"求贤若渴","yuanwen":"井：改邑不改井，无丧无得，往来井井。汔至，亦未 井，羸其瓶，凶。\r\n初六：井泥不食，旧井无禽。\r\n九二：井谷射鲋，瓮敝漏。\r\n九三：井渫不为我民恻，可用汲，王明，并受其福。\r\n六四：井 ，无咎。\r\n九五：井冽，寒泉食。\r\n上六：井收勿幕，有孚无吉。","zhujie":"《井》：住户可以搬迁，但泉井不能移动，纵使人来人往取水，井既无损失亦无得益。如果你有机会，却不用绳绑吊桶来取水，吊水桶就会腐坏，凶。\r\n\r\n倒数第一阴爻：水井有泥，水不能喝。旧的陷阱（坏了），没有兽(掉下去）。\r\n倒数第二阳爻：在塌井的积水里射小鱼，（难射中）。水瓮漏了，（不能储水）。\r\n倒数第三阳爻：井水清了却不喝，为此我心悲痛。可以汲水，国王明察，臣民都得到他的福。\r\n倒数第四阴爻：井壁砌好了，无害。\r\n倒数第五阳爻：井水清泉水凉，可喝。\r\n最上阴爻：阱口收小，不要盖上，有收获大吉。"}