package com.duke.yinyangli.utils.core.mingzidafen;

import java.util.ArrayList;

/**汉字五行笔画库
 */
public class BhFTWxLib {

    private ArrayList<MetaLibItem> libs = new ArrayList();

    public BhFTWxLib() {
        this.libs.add(new MetaLibItem(1, 2, "一乙"));
        this.libs.add(new MetaLibItem(2, 4, "乃了力丁刀刁二又人入七十几"));
        this.libs.add(new MetaLibItem(3, 0, "口干工弓久己土大丈女己巾勺丸也于弋巳兀三下上乞士夕千子寸小山川巳才凡"));
        this.libs.add(new MetaLibItem(4, 0, "公孔亢勾。中之丹井介今内及太天屯斗斤牛支允元勿午友尤尹引文月日牙王云匀牛四丑仁什切升收壬少心手日氏水尤仍双尺仇止才不互分匹化卡卞肥反夫巴幻户方木比毛仆丰火片"));
        this.libs.add(new MetaLibItem(5, 0, "古切可瓜甘刊五丘加去句叫外巧巨玉甲令加占主巨冬他代只仗另句召尼正田旦奴凸立叮仝伏台奶凹五外央右未永以戊玉瓦由幼仕巧丘仙兄司且史左世出市玄仔冉穴示生申充主仞仟册加去只叫求正甲申石匝甩丙平母弘末包本弗北必丕半布皿目乏禾皮疋矛乎付兄卉戊民冰玄白卯"));
        this.libs.add(new MetaLibItem(6, 0, "伉光匡共各考交件价企伍伎仰吉圭曲机艮六仲吉州朱兆决匠地旨朵吏列年劣同打汀至臼灯竹老舟伎吊吏圳的宅机老肉虫伊仰伍印因宇安屹有羊而耳衣亦吃夷奸聿丞企休任先全再冲刑向在夙如宅守字存寺式戌收早旭旬曲次此求系肉臣自舌血行圳西休交件企匠吉尖而至色伏后名回好妃帆灰牟百份米伐亥卉冰刑合向旭朴系行汜复"));
        this.libs.add(new MetaLibItem(7, 0, "克告改攻更杆谷况伽估君吸吾圻均坎完局岐我扣杞江究见角言住占低佃况里冷伶利助努君吝昌壮妓妞局弄廷弟彤志托杖杜呆李江男究良见角具皂里舟佟你体足甸町豆吞玎位佐畲冶吾吟吴吻完尾巫役忘我修言邑酉吟吴呆角七伸佐作些伽些初吹呈坐孝宋岐希岑床序巡形忍成杏材杉束村杞步汝汐池私秀赤足身车辰系占伺住余助劭劬邵吸坐壮妆局床志汕江灶见即却克早何布伯伴佛兵判别含坊阪吵宏旱每甫牡况免孚孝尾巫希庇形忙杏呆步汛贝儿"));
        this.libs.add(new MetaLibItem(8, 0, "供侃刻卦固坤姑官冈庚快抗昆果空亟其具券卷奇委季宜居届岢岸杰佳京侄佳来例制到兔两典卷周呢坦奈妮宙定居屉帖底店征忝忠念技投政枝东林汰决玖知的直纠金两乳侏佰侗佻佬具冽卓拈妲妯宕岱岭帖帙底抒林杼沓炉竺长依侑味夜委宜宛岳岸岩往亚武于易昂旺沅沃汪物艾卧佯儿咏抑昀炎杳事享侍使侈然刹刺协卒洽沁取受步垂奇始炊姓妻妾尚屈弦所承昌升昔松欣沙沈社舍炊采长青幸亟徇佳舍儿争其刷券制效卷姐姒姗季炙宗届岫征承昔析枕状八并佩函和命坡坪奉孟帛水府佛彼忽或戽房扮枇扶放昏朋服明杭杯枚板沛沐汾版牧虎门阜杷盲非"));
        this.libs.add(new MetaLibItem(9, 0, "冠奎皈客故柑柯况看科肝革屋癸砍禹轨页九亭亮柱俊侣冒段劲南姬姜姣宦帝度痔建峙待律怠急招拒拓拙拉昭架柱柳注治炭界皆突纪纣耐肚致计订军酊俐胃百厘咨姝姿柁沱炭妆纣重珏盅眈俄俞勇威娃姻姚姨屋幽彦奕哀哇玟怡押映昱韦油泳沿姚畏烟盈禹约耶衍要页音昱易柚胤易信侠系俗促俏前则奏型姹妊姝姿室宣巷咱哉思性施昨是春星查柴栅柔染泉帅甚相省砂祈秋穿肖重首酉食香侵俟峙旭注沐炷祉贞昌泓侯保便冒勉匍奔品佩杯封哈皇拔抱怕柏柄泌法泡炳玫盆眉红美虹秒表负面风飞眄胃勃厚咸叛孩奂屏枰某河泛研赴"));
        this.libs.add(new MetaLibItem(10, 0, "库恭拱格桂根耕耿股肯贡高个刚哥宫径挂皋径徒倜恬拯指拿料旅晋朕桌桔桃桐洞流洛酒烈特玲珍真矩祝秩租站级纸纳纽者肩芝记讨酌酒针钉只挑借倒值俱倪倘伦兼唐哲娘旃娟娜展峻准凌洲套爹特留俩倜庭恫耻烙料栗株津玳畜砧恩按案鸟洋秧翁纹耘育芽芸蚊袁烟倚原员埃宴峨倚娱容峪晏移益差师席座徐恰息恕肩持拳拾时书曹校朔桑栽殊气洽珊祠神祖秦秤索素纱纾纯虔讫训财起轩芩闪迅倩幸修仓城夏孙宰容射峡厝叟奚畜春乘借准淞宵指拭牲洵洳狩兹珊炸租站宸挈旁晃桓活洪畔亩眠破炮秘粉纺肺肥航般芳芙花配马侯倍俯俸们圃埋娩峰肪畔埔害恢恍恒柏派洹玻泌珉祜呗"));
        this.libs.add(new MetaLibItem(11, 0, "国寇昆康苦袍规贯够勘崞岗梗珙偕假健停侦剪动翎念基坚堂堆婧寄专张得教救朗条梁梯械梨浙浪珠略皎眷窕竟第终累舵苓架诀近钓顶鸟将那庶振挺捉捐甜祭趾囵堆凌崃带帐徕悌画梁梃桶町娄伟偶务唯问婉寅尉帷庸悟悠悦敖晚梧浴眼研移胃苑英迎野鱼欲浣翌圉干做区卿参售启商唱娶妇宿崇崎崔常强从悄叙旋晨晟族消爽犀祥绅细紫组绍婧羞习邢舷船茄若处术袖设讼责赦雀雪顷彩常孰侦匙圊执将专就峥崧巢庶彩悉施曹浙笙钏阡凰毫培婚婆妇密彬彪患斌曼海浩烽班瓶毕盒符邦胡背胞胖舶范茅苗袍被觅访货返贩闭麦麻邦壶票冕副埠屏捕敏皓梅第珩艴苹"));
        this.libs.add(new MetaLibItem(12, 0, "敢款淦筐给贵辜开凯昆诒询几蛟植堵堤奠岚帧掌掘捷掏掎推探接敦景智晶替朝椒棠栈殖淘添淡净焦街诊理荔眨贴屠贷轸迢迪迦量钧钮间集杰劳单婷喋传塘塔暖楠殿渡汤帏幄惟掩椅涯液渊焰为异砚围茵越阮轶雁雅寓云雯媛喻贻婺焱琬琰畲劳博堡报富寒嵋帽幅帮弼复彭徨偏整理惠扉排斑酣普棉棒棚涵混淼淮淝牌画番发皓脉茗评贺费买贸迫邯闵防阪黄傅傍媒媚黑瓿然"));
        this.libs.add(new MetaLibItem(13, 0, "匮块干感揆手楷港琨莞夸鼓该贾传仅涂塔塘廊谦提敬斟极楠殿汤渡绢经茎莒获莅庄莉蜀里装解詹鼎贾路迹退铃巨陀电雷靖顿暖桢路嫁农贮贷贴轸迪钠湍琳当略铃鼓励庸园圆奥爱意扬援握榆业杨椰涌渝渭游炜爷烟兽犹煜碗筠义肄莞莠虞蛾裕诣郁钰雍阿预饮衙莹蓊晕渥琬琰畹筵裔淡催传勤势嗣塞嵩厦新喧楸楚岁湘测凑煦琴琪琦睡祺稔稠筮粲绣群圣莎裙诩诗试诠详资载送铅阻雌颂驰熙暄琼塞嵩想桢椿岁渚煮琛庄裟输轼幕汇惶挥描换楣枫湖浑渺涣煤烦琶琥盟睦碑禀聘腑荷莫号蜂补话酩附颁饭晕募焕"));
        this.libs.add(new MetaLibItem(14, 0, "廓愧沟管纲诰闺魁构歌恺斡荣构嘏通连这甄兢喜团图奖嫡对僚侥屡嶂崭彰廖熊溜监祯种端箕筝精绿紧绫纶置璋畅榔糍滇尔莱赵铬领瑙奁闻嫣愿温源溢尔瑜瑛瑗玮与舞苑诱语郢银摇榕荣温荥溶烟菀鞅瑛僖逑速逍肾寿塾尘嫩实像侨岖慈滋沧溶溪熊狮瑞瑟硕算粹绸综绰绮翠菁菜菖裳认誓诵说诚轻菘造速衔铨限需韶饲饰旗畅荣榕齐熏僦尝墅奖实寨慎准溯搴逢梦仆幕滑瑚珲碧福绵翡腑萍华菩蜜裴豪宾辅郝铭阀陌颇饮凤鸣榜槐滏"));
        this.libs.add(new MetaLibItem(15, 0, "宽广慷惯概瑰葛葵课逵郭稿靠溉锆俭着价厉剧剑刘妖履帜弹征德虑摘敌整暂椿闾乐楼樟滴渐涨浆练缔蒂骀落董葶蝶调谆谈诋诤谅论质驼践轮逮进醇铝阵震霆驾驻稽稻稷节剪几鲁黎侬涤墩幢嶙锻褚亿仪影慰忧乐样欧毅演渔熬熠熨瑶缘纬腰万莹叶苇谊逸邮阅院鞍颐养欲颍粗缓卫葳骑妩鉴署啸增婵审层厂厨厮庆摧数枢漆熟热线肠兴萱冲褚谁请贤赏赐趣娴醉锐销爽霄驷确磁穷箭箱竖辍帜漩渐箴节绪翦葸诤谆质醇罚划哗坟墨币庙废慧慕慢暮樊标模流浒汉满漫漂玛缓编腹铺葆葡复卖赋辉辈部锋陛盘码篇范麾劈幡慧摩沪漠盘褒弼荭"));
        this.libs.add(new MetaLibItem(16, 0, "窥糕膏盖钢龟购器垦横橄篙馆尽坛导惮战撰整历瞳昙暨机橘洁潭灯瑾璋庐积筑蒸诸谛诺练猪赖蹄辑道达都录锦锭陆陶陵霓霖静颊头雕疆腿臻赚骆莅俦橙润澈笃缙萤卫谓谒谙谕豫逾游运阴余壅赢蓉蓊勋儒器学宪熹憧晓桥樵橙橡树润潮甑莳璇聪融亲谌谐输遂醒钱错陈陲赛蓄苍侪澍莼谊铮锡阊桦壁奋播抚横潘磨蒙衡谋讳讽辨锚陪默蒲蓓滨嬖凭颖蓉运阴余"));
        this.libs.add(new MetaLibItem(17, 0, "恳桧糠馆阶瞰励岭懂挡担据捡激浓烛瞳璐矶磷绩联胶膛临举莲蔗蒋讲递辗镀锻钟键隆队骏黛点泽沣潞澄优婴屿狱赢应忆拥澳营蔚荫舆锾闱阳偿择擅操泽澡燧禧穗簇纵总聪声膝襄谦逮邹乡隋虽霞霜鲜戏鸿壕嫔弥帮桧篷缝繁褒锚韩蔓征擘扶"));
        this.libs.add(new MetaLibItem(18, 0, "柜圹归缋蒉磬纩戴拟抬挤爵涛礼简粮职旧蕉谨转遮题镇储藜芷迟鲤翼芸讴医隘额瑷莸镒隗彝潍储丛曙湿织萧蕊蝉瑞适双绣锁垒戴断柠涛泞璐礼粮藜槟滨获壁环蕃丰庞璧馥"));
        this.libs.add(new MetaLibItem(19, 0, "扩关铿庐疆祷荐勒襟谭证轿辽邻郑邓类鲸丽麓镜觉际橹栎泺辚链韵稳薏薇膺臆蚁袄遗雾愿艳蓣蕹韫玺薛薪绳蟹识赞遵迁选庞渖荐谯旋锵镞铲际颡鹑暹攀簿绘鹏庞瀑宝祢薜谱镆镘"));
        this.libs.add(new MetaLibItem(20, 0, "矿阚岿藉蓝拢沥泷竞篮罗舰觉警钟露腾党枥槠滤濑炉窦笞筹镦荩严瀛耀译议邀懿赢萨藏熏壤悬曦琼筹脐馨释献坏孀籍藉谵锈钟宝怀瀚缤还迈飘膑朦濒铧"));
        this.libs.add(new MetaLibItem(21, 0, "顾钚俪栏铁鸡镯藤览镭铎铛膑丽斓樱艺藕誉跃迩莺险续随属攘誉茑鸡藩轰辩癖霸鹤钚"));
        this.libs.add(new MetaLibItem(22, 0, "灌垄迭笼听芦览读铸籁苈链懿蔼隐璎蕴鳙欢边鳗镔沣镬"));
        this.libs.add(new MetaLibItem(23, 0, "矿恋兰体滩铄鳞驿验缨织显钻变蘩"));
        this.libs.add(new MetaLibItem(24, 0, "罐赣雳灵陇酿鹰霭坝嬖"));
        this.libs.add(new MetaLibItem(25, 0, "观戆厅篱钥瑷镶黉颢"));
        this.libs.add(new MetaLibItem(26, 0, "逻驴湾灒"));
        this.libs.add(new MetaLibItem(27, 1, "銮骥湾钻骧驤缆纜銮鑾"));
        this.libs.add(new MetaLibItem(28, 0, "鹦艳"));
        this.libs.add(new MetaLibItem(29, 0, "鹳郁"));
        this.libs.add(new MetaLibItem(30, 0, "戆吁"));

    }
 
    public int getStringLibs(char item) {
        for (int i = 0; i < libs.size(); i++) {
            if (libs.get(i).ifStringexist(item)) {
                return i;
            }
        }
        return -1;
    }
 
    public ArrayList<MetaLibItem> getLibs() {
        return this.libs;
    }
}