{"code":"100001","description":"山雷颐","guacishi":"山雷颐\r\n人生百事食为基\r\n细看朵颐福自知\r\n自力更生谋给养\r\n问占得利待来时","jiegua":"卦辞：文王访贤在渭滨，谋望求财事遂心。交易出行方如意，疾病口舌可离身。 \r\n推断：渭水访贤，大吉大利，占着此卦，好了运气。 \r\n大象：形如口腔之象，取其饮食之道，须慎言，注重日常生活。 \r\n运势：处事欠缺周详考虑，不宜心怀阴谋，要守正道而善方吉。 \r\n爱情：忌傲气凌人，宜重新估计对方之价值，切勿因情误了青春。\r\n疾病：占病为凶，久病者险，为肠胃、咽喉、手足之疾。 \r\n失物：尽快去找，似被物件上下夹著。 \r\n诉讼：我告他人终不能成，宜速和解。","jiewen":"《颐卦》象征颐养：只有坚守正道才能获得吉祥；通过观察能够体现颐养的具体实例，以及自己是如何谋取口中食物的，这样才能真正地掌握颐养之道，获得吉祥。《象》曰：山下有雷，君子以慎言语，节饮食。《象辞》说：《颐卦》的卦象是震（雷）下艮（山）上，为雷在山下震动之表象，引申为咀嚼食物时上颚静止、下颚活动的状态，因而象征颐养；颐养必须坚守正道，所以君子应当言语谨慎以培养美好的品德，节制饮食以养育健康的身体。\r\n\r\n初九，舍弃你如同神龟般的聪明智慧，痴呆地看着我鼓动腮帮子进食，结果必然导致凶险。《象》曰：“观我朵颐”，亦不足贵也。《象辞》说：“痴呆地看着我鼓动腮帮子进食”，是说初九爻虽重视保养身体，但由于不能坚守正道，并不值得推崇。\r\n\r\n六二，反过来向下属乞求食物以获取奉养，是违背常理的，向高丘处的乞食，则前进的途中必然遭遇凶险。《象》曰：六二“征凶”，行失类也。《象辞》说：《颐卦》的第二爻位（六二）“前进的途中必然遭遇凶险”，是因为前进的途中没有相应的同类。六三，拂颐，贞凶，十年勿用，无攸利。\r\n\r\n六三，违背颐养的正道，仍然一味地只求口腹之欲，结果必然遭遇凶险，在十年的漫长岁月里被遗弃而得不到养育，没有一点好处。《象》曰：“十年勿用”，道大悖也。《象辞》说：“在十年的漫长岁月里被遗弃而得不到养育”，是因为它与颐养的正道大相径庭，从根本上违背了养育他人和保养自己的原则和方法。\r\n\r\n六四，反过来向下属乞求食物以获取奉养，可以获得吉祥；因为这就像老虎要扑食那样，虎视眈眈，专心致志，孜孜以求，则必然能够达到目的，当然也没有什灾祸。《象》曰：“颠颐之吉”，上施光也。《象辞》说：“反过来向下属乞求食物以获取奉养的吉祥”，是因为六四位居在上，与初九照应，同时又能坚守正道，虽取之于民，却又用之于民，这也就是说，它能够向下普遍地施舍光明恩德。\r\n\r\n六五，违背颐养的正道，但是却能够安然地居于尊位，所以结果吉祥，只是尚不能处理极为艰险困难的事情，就像不能够涉过大河一样。《象》曰：“居贞之吉”，顺以从上也。《象辞》说：“能够安然地居于尊位，所以结果吉祥”，是因为能够顺从有阳刚之美的贤者。\r\n\r\n上九，天下百姓都依靠他的养育而得以安居乐业；肩负如此重任，必须谨防危险，有所戒惧才能获得吉祥，这样也才能排除万难，就像顺利涉过大河一样。《象》曰：“由颐厉吉”，大有庆也。《象辞》说：“天下百姓都依靠他的养育而得以安居乐业，必须谨防危险，有所戒惧才能获得吉祥”，是说养育天下百姓，因而能得到天下的信任和爱戴，达到普天同庆。","level":"上上卦","name":"颐","secondName":"纯正以养","yuanwen":"颐：贞吉。 观颐，自求口实。\r\n初九：舍尔灵龟，观我朵颐，凶。\r\n六二：颠颐，拂经，于丘颐，征凶。\r\n六三：拂颐，贞凶，十年勿用，无攸利。\r\n六四：颠颐吉，虎视眈眈，其欲逐逐，无咎。\r\n六五：拂经，居贞吉，不可涉大川。\r\n上九：由颐，厉吉，利涉大川。","zhujie":"《颐》卦：占问吉。观察面颊，(看人是否吃饱)，自己要求得口粮(来吃饱)\r\n\r\n倒数第一阳爻：放弃你灵验的龟，窥伺我鼓起面颊里的食物，凶。\r\n倒数第二阴爻：（六二求养于初九），是养生的颠倒，违反常理。（上九最高，有丘象）。六二求养于上，（非正应），往必凶。\r\n倒数第三阴爻：违反养生，占问凶。所以十年不用，用了无所利。\r\n倒数第四阴爻：（六四养初九，以阴养阳），是养生的颠倒。（但六四在初九之上，以上养下），是吉。（初九之刚），如虎视盯紧，它的欲望急迫，（六四不失以上养下之正），无害。\r\n倒数第五阴爻：（六五居尊位，赖上九以为养），是违反常理。（六五安静居于尊位），故占问居处吉。（既安静），故不可渡大河。\r\n最上的阳爻：（从上九来养人），是从养。（但上九位高），故心危才吉。（上九阳刚），故利于渡大河。"}